LOCAL_API_URL = 'http://localhost:8080/api/request'
REMOTE_API_URL = 'http://oopyat.duckdns.org/api/request'

test_cases = [
    {
        "question": "В каком городе находится главный кампус Университета ИТМО?\n1. Москва\n2. Санкт-Петербург\n3. Екатеринбург\n4. Нижний Новгород",
        "answer": 2},
    {"question": "Сколько человек обучается в итмо?\n1. Москва\n2. 1900\n3. 16000\n4. 25000", "answer": 3},
    {"question": "Как сейчас называется университет?\n1. ЛИТМО\n2. Санкт-Петербург\n3. СПБГУ\n4. ИТМО", "answer": 4},
    {"question": "Сколько образовательных программ в бакалавриате ИТМО?\n1. 26\n2. 12\n3. 100\n4. 20", "answer": 1},
    {
        "question": "Какое из следующих достижений позволит поступить в магистратуру итмо по БВИ?\n1. победа в МегаШколе\n2. Наличие паспорта\n3. победа в конкурсе `самые чистые ноздри`\n4. Высшая проба",
        "answer": 1},
    {
        "question": "По какому адресу находится корпус итмо на ломоносова?\n1. улица Ломоносова, 9\n2. Биржевая линия, 14\n3. Вашингтон\n4.  улица Ломоносова, 22",
        "answer": 1},
    {
        "question": "Какого факультета нет в итмо?\n1. Физико-технический мегафакультет\n2. Мегафакультет наук о жизни\n3. Факультет систем управления и робототехники\n4. Факультет экономики и финансов",
        "answer": 4},
    {'question': "В каком году был основан ИТМО\n1. 1900\n2. 1942\n3. 1820\n4. 2009", "answer": 1},
    {'question': "В каком году инициировали проект ИТМО ХАЙПАРК\n1. 2017\n2. 2020\n3. 2024\n4. 2009", "answer": 1},
    {
        'question': "Какой девиз университета ИТМО?\n1. IT's MOre than a UNIVERSITY!\n2. Выбирай итмо или не выбирай вообще\n3. Институт теплых мужских отношений\n4. Лучший вуз АЙТИ в россии",
        "answer": 1},
    {
        'question': "Кто главный маскот университета ИТМО?\n1. Снежный барс Тим\n2. Пума Клара\n3. Снежный барс Макс\n4. Даша путешественница",
        "answer": 1},
    {
        'question': "Сколько раз команда Университета ИТМО выигрывала Международную студенческую олимпиаду по программированию ACM ICPC?\n1. Пять\n2. шесть\n3. 7\n4. Восемь",
        "answer": 3},
    {'question': "В каком году Университет ИТМО впервые победил в ACM ICPC?\n1. 2000\n2. 2004\n3. 2008\n4. 2012",
     "answer": 2},
    {
        'question': "Какой язык программирования был создан выпускниками Университета ИТМО?\n1. Kotlin\n2. C\n3. Go\n4. Swift",
        "answer": 1},
    {
        'question': "Как называется проект по созданию нового кампуса Университета ИТМО на юге Санкт-Петербурга?\n1. ИТМО Хайпарк\n2. ИТМО Парк\n3. ИТМО сити\n4. ИТМО Центр",
        "answer": 1},
]
